In [1]:
import pandas as pd
import numpy as np

### DataFrame

In [4]:
df = pd.DataFrame({
    'Name':["Braund, Mr. Owen Harris", "Allen, Mr. William Henry","Bonnell, Miss. Elizabeth"],
    'Age': [22, 35, 58],
    'Sex': ["male", "male", "female"],
})
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [6]:
df.columns

Index(['Name', 'Age', 'Sex'], dtype='object')

In [7]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [15]:
type(df['Age'])

pandas.core.series.Series

In [16]:
df['Age']

0    22
1    35
2    58
Name: Age, dtype: int64

In [10]:
df.Age

0    22
1    35
2    58
Name: Age, dtype: int64

In [12]:
df[0:2]

                       Name  Age   Sex
0   Braund, Mr. Owen Harris   22  male
1  Allen, Mr. William Henry   35  male

### Series

In [20]:
Name = pd.Series(["Braund, Mr. Owen Harris", "Allen, Mr. William Henry","Bonnell, Miss. Elizabeth"])
Name

0     Braund, Mr. Owen Harris
1    Allen, Mr. William Henry
2    Bonnell, Miss. Elizabeth
dtype: object

In [21]:
Age = pd.Series([22, 35, 58])
Age

0    22
1    35
2    58
dtype: int64

In [22]:
Sex = pd.Series(["male", "male", "female"])
Sex

0      male
1      male
2    female
dtype: object

In [23]:
df1 = pd.DataFrame({
    'name': Name,
    'age': Age,
    'sex': Sex
})
df1

                       name  age     sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

### Summery
* Import the package, aka import pandas as pd
* A table of data is stored as a pandas DataFrame
* Each column in a DataFrame is a Series
* You can do things by applying a method to a DataFrame or Series